Model: "X3D-L"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16, 312, 312, 3)] 0         
_________________________________________________________________
conv_1 (X3D_Stem)            (None, 16, 156, 156, 24)  864       
_________________________________________________________________
res_stage_2 (ResStage)       (None, 16, 78, 78, 24)    26340     
_________________________________________________________________
res_stage_3 (ResStage)       (None, 16, 39, 39, 48)    151372    
_________________________________________________________________
res_stage_4 (ResStage)       (None, 16, 20, 20, 96)    1315752   
_________________________________________________________________
res_stage_5 (ResStage)       (None, 16, 10, 10, 192)   2929264   
_________________________________________________________________
conv_5 (Sequential)          (None, 16, 10, 10, 432)   84672     
_________________________________________________________________
pool_5 (AdaptiveAvgPool3D)   (None, 1, 1, 1, 432)      0         
_________________________________________________________________
fc_1 (Conv3D)                (None, 1, 1, 1, 2048)     884736    
_________________________________________________________________
dropout (Dropout)            (None, 1, 1, 1, 2048)     0         
_________________________________________________________________
fc_2 (Dense)                 (None, 1, 1, 1, 400)      819600    
=================================================================
Total params: 6,212,600
Trainable params: 6,146,288
Non-trainable params: 66,312
_________________________________________________________________
None
Runtime: 6.6024s