Model: "X3D-S"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 13, 160, 160, 3)] 0         
_________________________________________________________________
conv_1 (X3D_Stem)            (None, 13, 80, 80, 24)    864       
_________________________________________________________________
res_stage_2 (ResStage)       (None, 13, 40, 40, 24)    16258     
_________________________________________________________________
res_stage_3 (ResStage)       (None, 13, 20, 20, 48)    74140     
_________________________________________________________________
res_stage_4 (ResStage)       (None, 13, 10, 10, 96)    581064    
_________________________________________________________________
res_stage_5 (ResStage)       (None, 13, 5, 5, 192)     1334496   
_________________________________________________________________
conv_5 (Sequential)          (None, 13, 5, 5, 432)     84672     
_________________________________________________________________
pool_5 (AdaptiveAvgPool3D)   (None, 1, 1, 1, 432)      0         
_________________________________________________________________
fc_1 (Conv3D)                (None, 1, 1, 1, 2048)     884736    
_________________________________________________________________
dropout (Dropout)            (None, 1, 1, 1, 2048)     0         
_________________________________________________________________
fc_2 (Dense)                 (None, 1, 1, 1, 400)      819600    
=================================================================
Total params: 3,795,830
Trainable params: 3,764,366
Non-trainable params: 31,464
_________________________________________________________________
None
Runtime: 3.2148s