Model: "X3D-XL"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 16, 312, 312, 3)] 0         
_________________________________________________________________
conv_1 (X3D_Stem)            (None, 16, 156, 156, 32)  1152      
_________________________________________________________________
res_stage_2 (ResStage)       (None, 16, 78, 78, 32)    41128     
_________________________________________________________________
res_stage_3 (ResStage)       (None, 16, 39, 39, 72)    315782    
_________________________________________________________________
res_stage_4 (ResStage)       (None, 16, 20, 20, 136)   2533118   
_________________________________________________________________
res_stage_5 (ResStage)       (None, 16, 10, 10, 280)   5996590   
_________________________________________________________________
conv_5 (Sequential)          (None, 16, 10, 10, 630)   178920    
_________________________________________________________________
pool_5 (AdaptiveAvgPool3D)   (None, 1, 1, 1, 630)      0         
_________________________________________________________________
fc_1 (Conv3D)                (None, 1, 1, 1, 2048)     1290240   
_________________________________________________________________
dropout (Dropout)            (None, 1, 1, 1, 2048)     0         
_________________________________________________________________
fc_2 (Dense)                 (None, 1, 1, 1, 400)      819600    
=================================================================
Total params: 11,176,530
Trainable params: 11,080,886
Non-trainable params: 95,644
_________________________________________________________________
None
Runtime: 6.4756s